In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math
import warnings

In [6]:
warnings.filterwarnings("ignore")

In [ ]:
# SERIES

In [21]:
v = np.array([i for i in range(1,5)])
s1 = pd.Series(v)

print(s1)
print("data type : ",s1.dtype)
print("total byte : ",s1.nbytes)
print("shape : ",s1.shape)
print("item count" ,s1.count())

0    1
1    2
2    3
3    4
dtype: int32
data type :  int32
total byte :  16
shape :  (4,)
item count 4

In [23]:
s2 = pd.Series([1,2,3],index=["a","b","c"])

print(s2)

s2.index = ["x","y","z"]
print(s2)

a    1
b    2
c    3
dtype: int64
x    1
y    2
z    3
dtype: int64

In [25]:
v = np.random.random(3)
ind = np.arange(3)

s = pd.Series(v,ind)
print(s)

0    0.020425
1    0.209554
2    0.018124
dtype: float64

In [42]:
dict1 = {"f" : 61 , "d" : 16}
sd = pd.Series(dict1)
print(s)

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [28]:
s = pd.Series(5,[i for i in range(5)])
print(s)

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [37]:
print(s[0:2])

0    5
1    5
dtype: int64

In [53]:
# append 

s2 = s.copy() * 2

s3 = s2.append(sd)
print(s3)

0    10
1    10
2    10
3    10
4    10
f    61
d    16
dtype: int64

In [54]:
# inplace

s3.drop(0,inplace=False)
print(s3)

s3.drop(0,inplace=True)
print(s3)

0    10
1    10
2    10
3    10
4    10
f    61
d    16
dtype: int64
1    10
2    10
3    10
4    10
f    61
d    16
dtype: int64

In [55]:
s1 = pd.Series([1,2,3])
s2 = pd.Series([10,20,30])

In [56]:
# Add

print(s1.add(s2))

0    11
1    22
2    33
dtype: int64

In [57]:
# Subtract

print(s1.subtract(s2))

0    -9
1   -18
2   -27
dtype: int64

In [58]:
# Multiply

print(s1.mul(s2))

0    10
1    40
2    90
dtype: int64

In [59]:
# Multiply

print(s1.divide(s2))

0    0.1
1    0.1
2    0.1
dtype: float64

In [ ]:
# max min mean median std

In [60]:
# equals 

print(s1.equals(s2))

False

In [64]:
# value_counts

ss = pd.Series([1,1,2,2,3,3] , [i for i in range(6)])
print(ss.value_counts())

1    2
2    2
3    2
dtype: int64

In [ ]:
# DATAFRAMES

In [71]:
lang = ["C","C++","C#","Python"]
df = pd.DataFrame(lang)
print(df)

        0
0       C
1     C++
2      C#
3  Python

In [72]:
rating=[1,2,3,1]
df[1] = rating
print(df)

        0  1
0       C  1
1     C++  2
2      C#  3
3  Python  1

In [73]:
df.columns = ["Langs","Rating"]
print(df)

    Langs  Rating
0       C       1
1     C++       2
2      C#       3
3  Python       1

In [76]:
data = [{"Lang":"C" } ,{"Lang":"C++", "Rating":3} ,{"Lang":"C#", "Rating":4} , {"Lang":"Python", "Rating":5} ]
df1 = pd.DataFrame(data)
df1

     Lang  Rating
0       C     NaN
1     C++     3.0
2      C#     4.0
3  Python     5.0

In [85]:
# daterange
dates = pd.date_range('today',periods=3)
dates

DatetimeIndex(['2022-05-20 21:16:35.382212', '2022-05-21 21:16:35.382212',
               '2022-05-22 21:16:35.382212'],
              dtype='datetime64[ns]', freq='D')

In [86]:
dates = pd.date_range(start='2022-05-20',end='2022-05-23')
dates

DatetimeIndex(['2022-05-20', '2022-05-21', '2022-05-22', '2022-05-23'], dtype='datetime64[ns]', freq='D')

In [94]:
M = np.random.random((4,4)) * 10
M

array([[0.8256528 , 3.03332591, 4.10298024, 0.49904162],
       [0.04552646, 8.44768622, 9.89551098, 4.69404384],
       [5.45057948, 1.07868172, 6.72538805, 6.00380973],
       [9.47273431, 6.04871356, 0.31309425, 8.26806162]])

In [108]:
df = pd.DataFrame(M,index=dates,columns=["c1","c2","c3","c4"])
df

                  c1        c2        c3        c4
2022-05-20  0.825653  3.033326  4.102980  0.499042
2022-05-21  0.045526  8.447686  9.895511  4.694044
2022-05-22  5.450579  1.078682  6.725388  6.003810
2022-05-23  9.472734  6.048714  0.313094  8.268062

In [109]:
# sorting by column

df.sort_values(by="c1" )

                  c1        c2        c3        c4
2022-05-21  0.045526  8.447686  9.895511  4.694044
2022-05-20  0.825653  3.033326  4.102980  0.499042
2022-05-22  5.450579  1.078682  6.725388  6.003810
2022-05-23  9.472734  6.048714  0.313094  8.268062

In [110]:
df.sort_values(by="c1" , ascending=False)

                  c1        c2        c3        c4
2022-05-23  9.472734  6.048714  0.313094  8.268062
2022-05-22  5.450579  1.078682  6.725388  6.003810
2022-05-20  0.825653  3.033326  4.102980  0.499042
2022-05-21  0.045526  8.447686  9.895511  4.694044

In [111]:
# delete a column

del df['c4']
df

                  c1        c2        c3
2022-05-20  0.825653  3.033326  4.102980
2022-05-21  0.045526  8.447686  9.895511
2022-05-22  5.450579  1.078682  6.725388
2022-05-23  9.472734  6.048714  0.313094

In [115]:
col1 = np.linspace(10,100,5)
col2 = np.linspace(20,200,5)

df = pd.DataFrame({"c1":col1 , "c2":col2})
df

      c1     c2
0   10.0   20.0
1   32.5   65.0
2   55.0  110.0
3   77.5  155.0
4  100.0  200.0

In [116]:
# delete row or rows

df = df.drop([1,2], axis=0)
df

      c1     c2
0   10.0   20.0
3   77.5  155.0
4  100.0  200.0

In [117]:
df.drop([3], axis=0 , inplace=True)
df

      c1     c2
0   10.0   20.0
4  100.0  200.0

In [123]:
col1 = np.linspace(10,100,7)
col2 = np.linspace(20,200,7)

df = pd.DataFrame({"c1":col1 , "c2":col2})

In [124]:
# iloc 

# 2.indexten öncekileri siler
df = df.iloc[2:,]
df

      c1     c2
2   40.0   80.0
3   55.0  110.0
4   70.0  140.0
5   85.0  170.0
6  100.0  200.0

In [125]:
# son iki elemanı siler
df = df.iloc[:-2]
df

     c1     c2
2  40.0   80.0
3  55.0  110.0
4  70.0  140.0

In [127]:
col1 = np.linspace(10,100,7)
col2 = np.linspace(20,200,7)

df = pd.DataFrame({"c1":col1 , "c2":col2})
df

      c1     c2
0   10.0   20.0
1   25.0   50.0
2   40.0   80.0
3   55.0  110.0
4   70.0  140.0
5   85.0  170.0
6  100.0  200.0

In [133]:
df[2:5]

     c1     c2
2  40.0   80.0
3  55.0  110.0
4  70.0  140.0

In [129]:
df.index[df["c1"] > 40 ].tolist()

[3, 4, 5, 6]

In [130]:
df.drop(df.index[df["c1"] > 40 ].tolist() , axis=0 , inplace=True)
df

     c1    c2
0  10.0  20.0
1  25.0  50.0
2  40.0  80.0

In [147]:
col1 = np.linspace(10,100,7)
col2 = np.linspace(20,200,7)
col3 = np.linspace(1,10,7)

df = pd.DataFrame({"c1":col1 , "c2":col2 , "c3":col3})

In [148]:
df.loc[:,["c2","c3"]]

      c2    c3
0   20.0   1.0
1   50.0   2.5
2   80.0   4.0
3  110.0   5.5
4  140.0   7.0
5  170.0   8.5
6  200.0  10.0

In [149]:
df[df["c1"] > 80]

      c1     c2    c3
5   85.0  170.0   8.5
6  100.0  200.0  10.0

In [150]:
df.at[0:3,["c3"]] = 61
df

      c1     c2    c3
0   10.0   20.0  61.0
1   25.0   50.0  61.0
2   40.0   80.0  61.0
3   55.0  110.0  61.0
4   70.0  140.0   7.0
5   85.0  170.0   8.5
6  100.0  200.0  10.0

In [151]:
df.iat[0,0] = 16
df

      c1     c2    c3
0   16.0   20.0  61.0
1   25.0   50.0  61.0
2   40.0   80.0  61.0
3   55.0  110.0  61.0
4   70.0  140.0   7.0
5   85.0  170.0   8.5
6  100.0  200.0  10.0

In [155]:
df.at[0:2,["c1","c2"]] = np.NaN
df.at[0:3,["c3"]] = np.NaN
df

      c1     c2    c3
0    NaN    NaN   NaN
1    NaN    NaN   NaN
2    NaN    NaN   NaN
3   55.0  110.0   NaN
4   70.0  140.0   7.0
5   85.0  170.0   8.5
6  100.0  200.0  10.0

In [160]:
df = df.fillna(61)
df

      c1     c2    c3
0   61.0   61.0  61.0
1   61.0   61.0  61.0
2   61.0   61.0  61.0
3   55.0  110.0  61.0
4   70.0  140.0   7.0
5   85.0  170.0   8.5
6  100.0  200.0  10.0

In [162]:
df.max() , df.min()

(c1    100.0
 c2    200.0
 c3     61.0
 dtype: float64,
 c1    55.0
 c2    61.0
 c3     7.0
 dtype: float64)

In [165]:
df.median() , df.mean()

(c1     61.0
 c2    110.0
 c3     61.0
 dtype: float64,
 c1     70.428571
 c2    114.714286
 c3     38.500000
 dtype: float64)

In [166]:
df.std() , df.var()

(c1    16.287594
 c2    57.223871
 c3    28.075790
 dtype: float64,
 c1     265.285714
 c2    3274.571429
 c3     788.250000
 dtype: float64)

In [163]:
df.describe()

               c1          c2        c3
count    7.000000    7.000000   7.00000
mean    70.428571  114.714286  38.50000
std     16.287594   57.223871  28.07579
min     55.000000   61.000000   7.00000
25%     61.000000   61.000000   9.25000
50%     61.000000  110.000000  61.00000
75%     77.500000  155.000000  61.00000
max    100.000000  200.000000  61.00000

In [167]:
df.apply(max)

c1    100.0
c2    200.0
c3     61.0
dtype: float64

In [169]:
#bütün verinin karekökünü almak
df.applymap(np.sqrt)

          c1         c2        c3
0   7.810250   7.810250  7.810250
1   7.810250   7.810250  7.810250
2   7.810250   7.810250  7.810250
3   7.416198  10.488088  7.810250
4   8.366600  11.832160  2.645751
5   9.219544  13.038405  2.915476
6  10.000000  14.142136  3.162278

In [172]:
df.apply(lambda x : np.sqrt(x))

          c1         c2        c3
0   7.810250   7.810250  7.810250
1   7.810250   7.810250  7.810250
2   7.810250   7.810250  7.810250
3   7.416198  10.488088  7.810250
4   8.366600  11.832160  2.645751
5   9.219544  13.038405  2.915476
6  10.000000  14.142136  3.162278

In [181]:
daf1 = pd.DataFrame({"id" : [1,2,3,4,5] , "name" : ["fatih","kadir","ali","murat","nuh"]})
daf2 = pd.DataFrame({"id" : [1,2,3,6,7] , "score" : ["61","16","34","9","62"]})

In [182]:
# inner join 
pd.merge(daf1,daf2,on="id",how="inner")

   id   name score
0   1  fatih    61
1   2  kadir    16
2   3    ali    34

In [183]:
# outer join 
pd.merge(daf1,daf2,on="id",how="outer")

   id   name score
0   1  fatih    61
1   2  kadir    16
2   3    ali    34
3   4  murat   NaN
4   5    nuh   NaN
5   6    NaN     9
6   7    NaN    62

In [188]:
#left outer join
pd.merge(daf1,daf2,on="id",how="left")

   id   name score
0   1  fatih    61
1   2  kadir    16
2   3    ali    34
3   4  murat   NaN
4   5    nuh   NaN

In [187]:
# right outer join
pd.merge(daf1,daf2,on="id",how="right")

   id   name score
0   1  fatih    61
1   2  kadir    16
2   3    ali    34
3   6    NaN     9
4   7    NaN    62

In [207]:
# read data from csv file

covid = pd.read_csv("../Data/covid.csv")

In [208]:
covid.describe()

,FIPS,Lat,Long_,Confirmed,Deaths,Recovered,Active,Incident_Rate,Case_Fatality_Ratio
count,3268.000000,3921.000000,3921.000000,4.011000e+03,4011.000000,0.0,0.0,3918.000000,3971.000000
mean,32405.943390,35.785662,-71.194102,1.306531e+05,1564.078285,NaN,NaN,22873.673595,2.513526
std,18056.381177,13.355142,55.085839,8.117767e+05,8268.874832,NaN,NaN,8508.337534,49.258190
min,60.000000,-71.949900,-178.116500,0.000000e+00,0.000000,NaN,NaN,0.000000,0.000000
25%,19048.500000,33.205219,-96.580954,3.050500e+03,42.000000,NaN,NaN,19357.852700,0.937407
50%,30068.000000,37.919235,-86.717326,8.584000e+03,118.000000,NaN,NaN,23906.341536,1.395349
75%,47041.500000,42.183322,-77.358708,3.767200e+04,407.500000,NaN,NaN,27665.631563,1.910479
max,99999.000000,71.706900,178.065000,2.852119e+07,168712.000000,NaN,NaN,118343.195266,3041.250000

In [209]:
covid.head(2)

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
0,NaN,NaN,NaN,Afghanistan,2022-05-20 04:20:57,33.93911,67.709953,179597,7695,NaN,NaN,Afghanistan,461.352823,4.284593
1,NaN,NaN,NaN,Albania,2022-05-20 04:20:57,41.15330,20.168300,275732,3497,NaN,NaN,Albania,9581.346862,1.268260

In [210]:
covid.tail(2)

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
4009,NaN,NaN,NaN,Zambia,2022-05-20 04:20:57,-13.133897,27.849332,320945,3984,NaN,NaN,Zambia,1745.788556,1.241334
4010,NaN,NaN,NaN,Zimbabwe,2022-05-20 04:20:57,-19.015438,29.154857,250206,5487,NaN,NaN,Zimbabwe,1683.423460,2.192993

In [211]:
covid[covid["Country_Region"] == "Turkey"]

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
674,NaN,NaN,NaN,Turkey,2022-05-20 04:20:57,38.9637,35.2433,15060112,98918,NaN,NaN,Turkey,17856.626277,0.656821

In [212]:
covid["Country_Region"].unique

<bound method Series.unique of 0                Afghanistan
1                    Albania
2                    Algeria
3                    Andorra
4                     Angola
                ...
4006      West Bank and Gaza
4007    Winter Olympics 2022
4008                   Yemen
4009                  Zambia
4010                Zimbabwe
Name: Country_Region, Length: 4011, dtype: object>

In [213]:
covid["Country_Region"].nunique()

199

In [214]:
covid.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4011 entries, 0 to 4010
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   FIPS                 3268 non-null   float64
 1   Admin2               3272 non-null   object
 2   Province_State       3834 non-null   object
 3   Country_Region       4011 non-null   object
 4   Last_Update          4011 non-null   object
 5   Lat                  3921 non-null   float64
 6   Long_                3921 non-null   float64
 7   Confirmed            4011 non-null   int64
 8   Deaths               4011 non-null   int64
 9   Recovered            0 non-null      float64
 10  Active               0 non-null      float64
 11  Combined_Key         4011 non-null   object
 12  Incident_Rate        3918 non-null   float64
 13  Case_Fatality_Ratio  3971 non-null   float64
dtypes: float64(7), int64(2), object(5)
memory usage: 438.8+ KB

In [216]:
df = covid[["Country_Region","Confirmed","Deaths"]]
df

            Country_Region  Confirmed  Deaths
0              Afghanistan     179597    7695
1                  Albania     275732    3497
2                  Algeria     265841    6875
3                  Andorra      42572     153
4                   Angola      99287    1900
...                    ...        ...     ...
4006    West Bank and Gaza     657456    5659
4007  Winter Olympics 2022        535       0
4008                 Yemen      11819    2149
4009                Zambia     320945    3984
4010              Zimbabwe     250206    5487

[4011 rows x 3 columns]

In [217]:
display("sorted dataframe",df.sort_values(["Country_Region"],ascending=True).head(5))

'sorted dataframe'

  Country_Region  Confirmed  Deaths
0    Afghanistan     179597    7695
1        Albania     275732    3497
2        Algeria     265841    6875
3        Andorra      42572     153
4         Angola      99287    1900

In [219]:
for index , row in df.iterrows():
    if(row["Country_Region"] == "Angola"):
        display(row[["Country_Region","Confirmed","Deaths"]])

Country_Region    Angola
Confirmed          99287
Deaths              1900
Name: 4, dtype: object

In [220]:
# pokemon data setini incele

pokemon = pd.read_csv("../Data/pokemon.csv")
pokemon.describe()

,#,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation
count,800.000000,800.00000,800.000000,800.000000,800.000000,800.000000,800.000000,800.000000,800.00000
mean,362.813750,435.10250,69.258750,79.001250,73.842500,72.820000,71.902500,68.277500,3.32375
std,208.343798,119.96304,25.534669,32.457366,31.183501,32.722294,27.828916,29.060474,1.66129
min,1.000000,180.00000,1.000000,5.000000,5.000000,10.000000,20.000000,5.000000,1.00000
25%,184.750000,330.00000,50.000000,55.000000,50.000000,49.750000,50.000000,45.000000,2.00000
50%,364.500000,450.00000,65.000000,75.000000,70.000000,65.000000,70.000000,65.000000,3.00000
75%,539.250000,515.00000,80.000000,100.000000,90.000000,95.000000,90.000000,90.000000,5.00000
max,721.000000,780.00000,255.000000,190.000000,230.000000,194.000000,230.000000,180.000000,6.00000

In [221]:
pokemon.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [226]:
pokemon[pokemon["Type 1"] == "Grass"].nunique()

#             66
Name          70
Type 1         1
Type 2        10
Total         50
HP            25
Attack        37
Defense       30
Sp. Atk       40
Sp. Def       29
Speed         38
Generation     6
Legendary      2
dtype: int64